AzureActivity
| where OperationNameValue has "networkSecurityGroups" and (OperationNameValue has "write" or OperationNameValue has "delete")
| project TimeGenerated, OperationNameValue, Resource, Caller, CallerIpAddress, ActivityStatusValue, SubscriptionId, ResourceGroup
| order by TimeGenerated desc
